from modules.base_module import CryptoModule
import streamlit as st

class WelcomeModule(CryptoModule):
    def __init__(self):
        super().__init__()
        self.name = "Добро пожаловать"
        self.description = "Введение в платформу"
        self.complexity = "beginner"
        self.category = "demo"
    
    def render(self):
        st.title("🔐 CryptoLab - Siberian Professional College")
        #st.subheader("Исследуй, взламывай, понимай")
        
        st.markdown("""
        ### Интерактивная лаборатория криптографии
        """)
        st.success("🚀 Выберите модуль из бокового меню чтобы начать!")        
        st.markdown("""
        Разработано в рамках дисциплины: "Криптографические средства защиты информации".
        
        #### На платформе Вы можете найти:
        - Визуальную реализацию известных шифров
        - Теоретическую информацию по криптографии
        - Практические тренажеры, в рамках дисциплины
        
        Вопросы и предложения, по работе платформы: <https://t.me/attack_beaver>
        """)
        
